OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16f1575.h
extern __at(0x0DC8) volatile __PWM4OFHbits_t PWM4OFHbits;

#define _PWM4OFH0               0x01
#define _PWM4OFH1               0x02
#define _PWM4OFH2               0x04
#define _PWM4OFH3               0x08
#define _PWM4OFH4               0x10
#define _PWM4OFH5               0x20
#define _PWM4OFH6               0x40
#define _PWM4OFH7               0x80

//==============================================================================

extern __at(0x0DC9) __sfr PWM4TMR;

//==============================================================================
//        PWM4TMRL Bits

extern __at(0x0DC9) __sfr PWM4TMRL;

typedef struct
  {
  unsigned PWM4TMRL0            : 1;
  unsigned PWM4TMRL1            : 1;
  unsigned PWM4TMRL2            : 1;
  unsigned PWM4TMRL3            : 1;
  unsigned PWM4TMRL4            : 1;
  unsigned PWM4TMRL5            : 1;
  unsigned PWM4TMRL6            : 1;
  unsigned PWM4TMRL7            : 1;
  } __PWM4TMRLbits_t;

extern __at(0x0DC9) volatile __PWM4TMRLbits_t PWM4TMRLbits;

#define _PWM4TMRL0              0x01
#define _PWM4TMRL1              0x02
#define _PWM4TMRL2              0x04
#define _PWM4TMRL3              0x08
#define _PWM4TMRL4              0x10
#define _PWM4TMRL5              0x20
#define _PWM4TMRL6              0x40
#define _PWM4TMRL7              0x80

//==============================================================================


//==============================================================================
//        PWM4TMRH Bits

extern __at(0x0DCA) __sfr PWM4TMRH;

typedef struct
  {
  unsigned PWM4TMRH0            : 1;
  unsigned PWM4TMRH1            : 1;
  unsigned PWM4TMRH2            : 1;
  unsigned PWM4TMRH3            : 1;
  unsigned PWM4TMRH4            : 1;
  unsigned PWM4TMRH5            : 1;
  unsigned PWM4TMRH6            : 1;
  unsigned PWM4TMRH7            : 1;
  } __PWM4TMRHbits_t;

extern __at(0x0DCA) volatile __PWM4TMRHbits_t PWM4TMRHbits;

#define _PWM4TMRH0              0x01
#define _PWM4TMRH1              0x02
#define _PWM4TMRH2              0x04
#define _PWM4TMRH3              0x08
#define _PWM4TMRH4              0x10
#define _PWM4TMRH5              0x20
#define _PWM4TMRH6              0x40
#define _PWM4TMRH7              0x80

//==============================================================================


//==============================================================================
//        PWM4CON Bits

extern __at(0x0DCB) __sfr PWM4CON;

typedef union
  {
  struct
    {
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned PWM4MODE0          : 1;
    unsigned PWM4MODE1          : 1;
    unsigned POL                : 1;
    unsigned OUT                : 1;
    unsigned OE                 : 1;
    unsigned EN                 : 1;
    };

  struct
    {
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned MODE0              : 1;
    unsigned MODE1              : 1;
    unsigned PWM4POL            : 1;
    unsigned PWM4OUT            : 1;
    unsigned PWM4OE             : 1;
    unsigned PWM4EN             : 1;
    };

  struct
    {
    unsigned                    : 2;
    unsigned MODE               : 2;
    unsigned                    : 4;
    };

  struct
    {
    unsigned                    : 2;
    unsigned PWM4MODE           : 2;
    unsigned                    : 4;
    };
  } __PWM4CONbits_t;

extern __at(0x0DCB) volatile __PWM4CONbits_t PWM4CONbits;

#define _PWM4CON_PWM4MODE0      0x04
#define _PWM4CON_MODE0          0x04
#define _PWM4CON_PWM4MODE1      0x08
#define _PWM4CON_MODE1          0x08
#define _PWM4CON_POL            0x10
#define _PWM4CON_PWM4POL        0x10
#define _PWM4CON_OUT            0x20
#define _PWM4CON_PWM4OUT        0x20
#define _PWM4CON_OE             0x40
#define _PWM4CON_PWM4OE         0x40
#define _PWM4CON_EN             0x80
#define _PWM4CON_PWM4EN         0x80

//==============================================================================


//==============================================================================
//        PWM4INTCON Bits

extern __at(0x0DCC) __sfr PWM4INTCON;

typedef union
  {
  struct
    {
    unsigned PRIE               : 1;
    unsigned DCIE               : 1;
    unsigned PHIE               : 1;
    unsigned OFIE               : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned PWM4PRIE           : 1;
    unsigned PWM4DCIE           : 1;
    unsigned PWM4PHIE           : 1;
    unsigned PWM4OFIE           : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };
  } __PWM4INTCONbits_t;

extern __at(0x0DCC) volatile __PWM4INTCONbits_t PWM4INTCONbits;

#define _PWM4INTCON_PRIE        0x01
#define _PWM4INTCON_PWM4PRIE    0x01
#define _PWM4INTCON_DCIE        0x02
#define _PWM4INTCON_PWM4DCIE    0x02
#define _PWM4INTCON_PHIE        0x04
#define _PWM4INTCON_PWM4PHIE    0x04
#define _PWM4INTCON_OFIE        0x08
#define _PWM4INTCON_PWM4OFIE    0x08

//==============================================================================


//==============================================================================
//        PWM4INTE Bits

extern __at(0x0DCC) __sfr PWM4INTE;

typedef union
  {
  struct
    {
    unsigned PRIE               : 1;
    unsigned DCIE               : 1;
    unsigned PHIE               : 1;
    unsigned OFIE               : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned PWM4PRIE           : 1;
    unsigned PWM4DCIE           : 1;
    unsigned PWM4PHIE           : 1;
    unsigned PWM4OFIE           : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };
  } __PWM4INTEbits_t;

extern __at(0x0DCC) volatile __PWM4INTEbits_t PWM4INTEbits;

#define _PWM4INTE_PRIE          0x01
#define _PWM4INTE_PWM4PRIE      0x01
#define _PWM4INTE_DCIE          0x02
#define _PWM4INTE_PWM4DCIE      0x02
#define _PWM4INTE_PHIE          0x04
#define _PWM4INTE_PWM4PHIE      0x04
#define _PWM4INTE_OFIE          0x08
#define _PWM4INTE_PWM4OFIE      0x08

//==============================================================================


//==============================================================================
//        PWM4INTF Bits

